{
  "ir_version": "1.0",
  "project": "agent-team-prd",
  "repository": "https://github.com/agentplexus/agent-team-prd",
  "versioning": "semver",
  "commit_convention": "conventional",
  "maintainers": ["agentplexus", "johncwang@gmail.com"],
  "releases": [
    {
      "version": "v0.2.0",
      "date": "2026-01-26",
      "highlights": [
        { "description": "Add structured-evaluation integration for standardized PRD quality reports", "commit": "df1c186" }
      ],
      "added": [
        { "description": "Add ScoreToEvaluationReport() for converting deterministic scoring to EvaluationReport format", "commit": "df1c186" },
        { "description": "Add GenerateEvaluationTemplate() for LLM judge template generation", "commit": "df1c186" },
        { "description": "Add GenerateEvaluationTemplateWithWeights() for custom category weights", "commit": "df1c186" },
        { "description": "Add StandardCategories() returning 10 PRD evaluation categories", "commit": "df1c186" },
        { "description": "Add CategoryDescriptions() and CategoryOwners() helper functions for LLM prompts", "commit": "df1c186" },
        { "description": "Add GetCategoriesFromDocument() to extract categories including custom sections", "commit": "df1c186" },
        { "description": "Add EvaluationCategory type alias for structured-prd evaluation category", "commit": "df1c186" }
      ],
      "dependencies": [
        { "description": "Update github.com/grokify/structured-requirements to v0.3.2", "commit": "df1c186" },
        { "description": "Add github.com/agentplexus/structured-evaluation v0.2.0 (transitive)", "commit": "df1c186" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-01-25",
      "highlights": [
        { "description": "Initial release of agent-team-prd: multi-agent system for PRD creation and review", "commit": "fce94de" },
        { "description": "16 specialized agents for discovery, specification, review, and revision workflows", "commit": "fce94de" },
        { "description": "Integration with github.com/grokify/structured-requirements for PRD schema", "commit": "fce94de" }
      ],
      "added": [
        { "description": "prdtool CLI for PRD management: init, validate, score, show, view commands", "commit": "fce94de" },
        { "description": "prdtool-mcp MCP server exposing PRD operations as tools for AI assistants", "commit": "fce94de" },
        { "description": "pkg/prd package wrapping structured-requirements types with helper functions", "commit": "fce94de" },
        { "description": "pkg/scoring package for PRD quality scoring against rubric", "commit": "fce94de" },
        { "description": "pkg/views package for PM and executive view generation", "commit": "fce94de" },
        { "description": "16 agent specifications: problem-discovery, user-research, market-intel, solution-ideation, requirements, ux-journey, tech-feasibility, metrics-success, risk-compliance, prd-lead, review-board, prd-scoring, exec-explainability, issue-extractor, revision-planner, change-validator", "commit": "fce94de" },
        { "description": "Team workflow specification with DAG-based orchestration", "commit": "fce94de" },
        { "description": "Deployment specifications for Claude Code, Kiro, Gemini, ADK, AWS Bedrock, CrewAI, and Kubernetes", "commit": "fce94de" },
        { "description": "prdtool schema command for programmatic JSON Schema access from structured-requirements", "commit": "fce94de" },
        { "description": "prd_schema MCP tool for AI agent schema access", "commit": "fce94de" }
      ],
      "documentation": [
        { "description": "MkDocs documentation site configuration", "commit": "fce94de" },
        { "description": "Agent specification markdown files with roles, responsibilities, and output formats", "commit": "fce94de" },
        { "description": "README with project overview and quick start", "commit": "fce94de" }
      ],
      "dependencies": [
        { "description": "github.com/grokify/structured-requirements v0.2.0 for PRD types and schema", "commit": "fce94de" },
        { "description": "github.com/agentplexus/mcpkit v0.3.1 for MCP server runtime", "commit": "fce94de" },
        { "description": "github.com/spf13/cobra v1.10.2 for CLI framework", "commit": "fce94de" }
      ]
    }
  ]
}
